bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51N19A.atdf
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22" ioset="3"/>
              <signal group="WO" index="0" function="E" pad="PB08" ioset="1"/>
              <signal group="WO" index="0" function="E" pad="PB12" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA23" ioset="3"/>
              <signal group="WO" index="1" function="E" pad="PB09" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PB13" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="56" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="57" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="58" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="30" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24" ioset="3"/>
              <signal group="WO" index="0" function="E" pad="PB10" ioset="1"/>
              <signal group="WO" index="0" function="E" pad="PB14" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA25" ioset="3"/>
              <signal group="WO" index="1" function="E" pad="PB11" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PB15" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="59" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="60" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="61" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="30" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
          <instance name="TC6">
            <register-group name="TC6" name-in-module="TC" address-space="base" offset="0x43001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA30" ioset="2"/>
              <signal group="WO" index="0" function="E" pad="PB02" ioset="3"/>
              <signal group="WO" index="0" function="E" pad="PB16" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA31" ioset="3"/>
              <signal group="WO" index="1" function="E" pad="PB03" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PB17" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="62" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="63" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="64" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="39" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="101"/>
            </parameters>
          </instance>
          <instance name="TC7">
            <register-group name="TC7" name-in-module="TC" address-space="base" offset="0x43001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20" ioset="1"/>
              <signal group="WO" index="0" function="E" pad="PB00" ioset="3"/>
              <signal group="WO" index="0" function="E" pad="PB22" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA21" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PB01" ioset="3"/>
              <signal group="WO" index="1" function="E" pad="PB23" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="65" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="66" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="67" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="39" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="102"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.1.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x41016000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PA20" ioset="6"/>
              <signal group="WO" index="0" function="G" pad="PB12" ioset="5"/>
              <signal group="WO" index="0" function="F" pad="PA08" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PC10" ioset="3"/>
              <signal group="WO" index="0" function="F" pad="PC16" ioset="4"/>
              <signal group="WO" index="1" function="G" pad="PA21" ioset="6"/>
              <signal group="WO" index="1" function="G" pad="PB13" ioset="5"/>
              <signal group="WO" index="1" function="F" pad="PA09" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PC11" ioset="3"/>
              <signal group="WO" index="1" function="F" pad="PC17" ioset="4"/>
              <signal group="WO" index="2" function="G" pad="PA22" ioset="6"/>
              <signal group="WO" index="2" function="G" pad="PB14" ioset="5"/>
              <signal group="WO" index="2" function="F" pad="PA10" ioset="1"/>
              <signal group="WO" index="2" function="F" pad="PC12" ioset="3"/>
              <signal group="WO" index="2" function="F" pad="PC18" ioset="4"/>
              <signal group="WO" index="3" function="G" pad="PA23" ioset="6"/>
              <signal group="WO" index="3" function="G" pad="PB15" ioset="5"/>
              <signal group="WO" index="3" function="F" pad="PA11" ioset="1"/>
              <signal group="WO" index="3" function="F" pad="PC13" ioset="3"/>
              <signal group="WO" index="3" function="F" pad="PC19" ioset="4"/>
              <signal group="WO" index="4" function="G" pad="PA16" ioset="5"/>
              <signal group="WO" index="4" function="G" pad="PB16" ioset="6"/>
              <signal group="WO" index="4" function="F" pad="PB10" ioset="1"/>
              <signal group="WO" index="4" function="F" pad="PC14" ioset="3"/>
              <signal group="WO" index="4" function="F" pad="PC20" ioset="4"/>
              <signal group="WO" index="5" function="G" pad="PA17" ioset="5"/>
              <signal group="WO" index="5" function="G" pad="PB17" ioset="6"/>
              <signal group="WO" index="5" function="F" pad="PB11" ioset="1"/>
              <signal group="WO" index="5" function="F" pad="PC15" ioset="3"/>
              <signal group="WO" index="5" function="F" pad="PC21" ioset="4"/>
              <signal group="WO" index="6" function="G" pad="PA18" ioset="3"/>
              <signal group="WO" index="6" function="G" pad="PB30" ioset="4"/>
              <signal group="WO" index="6" function="F" pad="PA12" ioset="1"/>
              <signal group="WO" index="7" function="G" pad="PA19" ioset="3"/>
              <signal group="WO" index="7" function="G" pad="PB31" ioset="4"/>
              <signal group="WO" index="7" function="F" pad="PA13" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="22" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="23" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="24" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="25" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="26" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DMAC_ID_MC4" value="27" caption="Indexes of DMA Match/Compare 4 trigger"/>
              <param name="DMAC_ID_MC5" value="28" caption="Indexes of DMA Match/Compare 5 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="43"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x41018000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PB10" ioset="4"/>
              <signal group="WO" index="0" function="G" pad="PC14" ioset="5"/>
              <signal group="WO" index="0" function="F" pad="PA16" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PB18" ioset="3"/>
              <signal group="WO" index="1" function="G" pad="PB11" ioset="4"/>
              <signal group="WO" index="1" function="G" pad="PC15" ioset="5"/>
              <signal group="WO" index="1" function="F" pad="PA17" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PB19" ioset="3"/>
              <signal group="WO" index="2" function="G" pad="PA12" ioset="4"/>
              <signal group="WO" index="2" function="G" pad="PA14" ioset="5"/>
              <signal group="WO" index="2" function="F" pad="PA18" ioset="1"/>
              <signal group="WO" index="2" function="F" pad="PB20" ioset="2"/>
              <signal group="WO" index="3" function="G" pad="PA13" ioset="4"/>
              <signal group="WO" index="3" function="G" pad="PA15" ioset="5"/>
              <signal group="WO" index="3" function="F" pad="PA19" ioset="1"/>
              <signal group="WO" index="3" function="F" pad="PB21" ioset="2"/>
              <signal group="WO" index="4" function="G" pad="PA08" ioset="3"/>
              <signal group="WO" index="4" function="G" pad="PC10" ioset="4"/>
              <signal group="WO" index="4" function="F" pad="PA20" ioset="1"/>
              <signal group="WO" index="5" function="G" pad="PA09" ioset="3"/>
              <signal group="WO" index="5" function="G" pad="PC11" ioset="4"/>
              <signal group="WO" index="5" function="F" pad="PA21" ioset="1"/>
              <signal group="WO" index="6" function="G" pad="PA10" ioset="2"/>
              <signal group="WO" index="6" function="G" pad="PC12" ioset="3"/>
              <signal group="WO" index="6" function="F" pad="PA22" ioset="1"/>
              <signal group="WO" index="7" function="G" pad="PA11" ioset="2"/>
              <signal group="WO" index="7" function="G" pad="PC13" ioset="3"/>
              <signal group="WO" index="7" function="F" pad="PA23" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="29" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="30" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="31" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="32" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="33" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="44"/>
            </parameters>
          </instance>
