bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51N19A.atdf
          <generator name="TC1_MC_0" index="77" module-instance="TC1"/>
          <generator name="TC1_MC_1" index="78" module-instance="TC1"/>
          <generator name="TC2_OVF" index="79" module-instance="TC2"/>
          <generator name="TC2_MC_0" index="80" module-instance="TC2"/>
          <generator name="TC2_MC_1" index="81" module-instance="TC2"/>
          <generator name="TC3_OVF" index="82" module-instance="TC3"/>
          <generator name="TC3_MC_0" index="83" module-instance="TC3"/>
          <generator name="TC3_MC_1" index="84" module-instance="TC3"/>
          <generator name="TC4_OVF" index="85" module-instance="TC4"/>
          <generator name="TC4_MC_0" index="86" module-instance="TC4"/>
          <generator name="TC4_MC_1" index="87" module-instance="TC4"/>
          <generator name="TC5_OVF" index="88" module-instance="TC5"/>
          <generator name="TC5_MC_0" index="89" module-instance="TC5"/>
          <generator name="TC5_MC_1" index="90" module-instance="TC5"/>
          <generator name="TC6_OVF" index="91" module-instance="TC6"/>
          <generator name="TC6_MC_0" index="92" module-instance="TC6"/>
          <generator name="TC6_MC_1" index="93" module-instance="TC6"/>
          <generator name="TC7_OVF" index="94" module-instance="TC7"/>
          <generator name="TC7_MC_0" index="95" module-instance="TC7"/>
          <generator name="TC7_MC_1" index="96" module-instance="TC7"/>
          <generator name="PDEC_OVF" index="97" module-instance="PDEC"/>
          <generator name="PDEC_ERR" index="98" module-instance="PDEC"/>
          <generator name="PDEC_DIR" index="99" module-instance="PDEC"/>
          <generator name="PDEC_VLC" index="100" module-instance="PDEC"/>
          <generator name="PDEC_MC_0" index="101" module-instance="PDEC"/>
          <generator name="PDEC_MC_1" index="102" module-instance="PDEC"/>
          <generator name="ADC0_RESRDY" index="103" module-instance="ADC0"/>
          <generator name="ADC0_WINMON" index="104" module-instance="ADC0"/>
          <generator name="ADC1_RESRDY" index="105" module-instance="ADC1"/>
          <generator name="ADC1_WINMON" index="106" module-instance="ADC1"/>
          <generator name="AC_COMP_0" index="107" module-instance="AC"/>
          <generator name="AC_COMP_1" index="108" module-instance="AC"/>
          <generator name="AC_WIN_0" index="109" module-instance="AC"/>
          <generator name="DAC_EMPTY_0" index="110" module-instance="DAC"/>
          <generator name="DAC_EMPTY_1" index="111" module-instance="DAC"/>
          <generator name="DAC_RESRDY_0" index="112" module-instance="DAC"/>
          <generator name="DAC_RESRDY_1" index="113" module-instance="DAC"/>
          <generator name="TRNG_READY" index="115" module-instance="TRNG"/>
          <generator name="CCL_LUTOUT_0" index="116" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="117" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="118" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="119" module-instance="CCL"/>
        </generators>
        <users>
          <user name="RTC_TAMPER" index="0" module-instance="RTC"/>
          <user name="PORT_EV_0" index="1" module-instance="PORT"/>
          <user name="PORT_EV_1" index="2" module-instance="PORT"/>
          <user name="PORT_EV_2" index="3" module-instance="PORT"/>
          <user name="PORT_EV_3" index="4" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="8" module-instance="DMAC"/>
          <user name="DMAC_CH_4" index="9" module-instance="DMAC"/>
          <user name="DMAC_CH_5" index="10" module-instance="DMAC"/>
          <user name="DMAC_CH_6" index="11" module-instance="DMAC"/>
          <user name="DMAC_CH_7" index="12" module-instance="DMAC"/>
          <user name="CM4_TRACE_START" index="14" module-instance="CM4"/>
          <user name="CM4_TRACE_STOP" index="15" module-instance="CM4"/>
          <user name="CM4_TRACE_TRIG" index="16" module-instance="CM4"/>
          <user name="TCC0_EV_0" index="17" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="18" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="19" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="20" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="21" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="22" module-instance="TCC0"/>
          <user name="TCC0_MC_4" index="23" module-instance="TCC0"/>
          <user name="TCC0_MC_5" index="24" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="25" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="26" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="27" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="28" module-instance="TCC1"/>
          <user name="TCC1_MC_2" index="29" module-instance="TCC1"/>
          <user name="TCC1_MC_3" index="30" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="31" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="32" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="33" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="34" module-instance="TCC2"/>
          <user name="TCC2_MC_2" index="35" module-instance="TCC2"/>
          <user name="TCC3_EV_0" index="36" module-instance="TCC3"/>
          <user name="TCC3_EV_1" index="37" module-instance="TCC3"/>
          <user name="TCC3_MC_0" index="38" module-instance="TCC3"/>
          <user name="TCC3_MC_1" index="39" module-instance="TCC3"/>
          <user name="TCC4_EV_0" index="40" module-instance="TCC4"/>
          <user name="TCC4_EV_1" index="41" module-instance="TCC4"/>
          <user name="TCC4_MC_0" index="42" module-instance="TCC4"/>
          <user name="TCC4_MC_1" index="43" module-instance="TCC4"/>
          <user name="TC0_EVU" index="44" module-instance="TC0"/>
          <user name="TC1_EVU" index="45" module-instance="TC1"/>
          <user name="TC2_EVU" index="46" module-instance="TC2"/>
          <user name="TC3_EVU" index="47" module-instance="TC3"/>
          <user name="TC4_EVU" index="48" module-instance="TC4"/>
          <user name="TC5_EVU" index="49" module-instance="TC5"/>
          <user name="TC6_EVU" index="50" module-instance="TC6"/>
          <user name="TC7_EVU" index="51" module-instance="TC7"/>
          <user name="PDEC_EVU_0" index="52" module-instance="PDEC"/>
          <user name="PDEC_EVU_1" index="53" module-instance="PDEC"/>
          <user name="PDEC_EVU_2" index="54" module-instance="PDEC"/>
          <user name="ADC0_START" index="55" module-instance="ADC0"/>
          <user name="ADC0_SYNC" index="56" module-instance="ADC0"/>
          <user name="ADC1_START" index="57" module-instance="ADC1"/>
          <user name="ADC1_SYNC" index="58" module-instance="ADC1"/>
          <user name="AC_SOC_0" index="59" module-instance="AC"/>
          <user name="AC_SOC_1" index="60" module-instance="AC"/>
          <user name="DAC_START_0" index="61" module-instance="DAC"/>
          <user name="DAC_START_1" index="62" module-instance="DAC"/>
          <user name="CCL_LUTIN_0" index="63" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="64" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="65" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="66" module-instance="CCL"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x61810301"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2501" version="1.0.0" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
