bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51N19A.atdf
        <register name="STATUS" offset="0x12" rw="R" size="2" initval="0x0000" caption="Status">
          <bitfield name="READY" caption="Ready to accept a command" mask="0x1"/>
          <bitfield name="PRM" caption="Power Reduction Mode" mask="0x2"/>
          <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x4"/>
          <bitfield name="SUSP" caption="NVM Write Or Erase Operation Is Suspended" mask="0x8"/>
          <bitfield name="AFIRST" caption="BANKA First" mask="0x10"/>
          <bitfield name="BPDIS" caption="Boot Loader Protection Disable" mask="0x20"/>
          <bitfield name="BOOTPROT" caption="Boot Loader Protection Size" mask="0xF00" values="NVMCTRL_STATUS__BOOTPROT"/>
        </register>
        <register name="ADDR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="NVM Address" mask="0xFFFFFF"/>
        </register>
        <register name="RUNLOCK" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Lock Section">
          <bitfield name="RUNLOCK" caption="Region Un-Lock Bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="PBLDATA" offset="0x1C" rw="R" size="4" count="2" initval="0xFFFFFFFF" caption="Page Buffer Load Data x">
          <bitfield name="DATA" caption="Page Buffer Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="ECCERR" offset="0x24" rw="R" size="4" initval="0x00000000" caption="ECC Error Status Register">
          <bitfield name="ADDR" caption="Error Address" mask="0xFFFFFF"/>
          <bitfield name="TYPEL" caption="Low Double-Word Error Type" mask="0x30000000" values="NVMCTRL_ECCERR__TYPEL"/>
          <bitfield name="TYPEH" caption="High Double-Word Error Type" mask="0xC0000000" values="NVMCTRL_ECCERR__TYPEH"/>
        </register>
        <register name="DBGCTRL" offset="0x28" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="ECCDIS" caption="Debugger ECC Read Disable" mask="0x1"/>
          <bitfield name="ECCELOG" caption="Debugger ECC Error Tracking Mode" mask="0x2"/>
        </register>
        <register name="SEECFG" offset="0x2A" rw="RW" size="1" initval="0x00" caption="SmartEEPROM Configuration Register">
          <bitfield name="WMODE" caption="Write Mode" mask="0x1" values="NVMCTRL_SEECFG__WMODE"/>
          <bitfield name="APRDIS" caption="Automatic Page Reallocation Disable" mask="0x2"/>
        </register>
        <register name="SEESTAT" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="SmartEEPROM Status Register">
          <bitfield name="ASEES" caption="Active SmartEEPROM Sector" mask="0x1"/>
          <bitfield name="LOAD" caption="Page Buffer Loaded" mask="0x2"/>
          <bitfield name="BUSY" caption="Busy" mask="0x4"/>
          <bitfield name="LOCK" caption="SmartEEPROM Write Access Is Locked" mask="0x8"/>
          <bitfield name="RLOCK" caption="SmartEEPROM Write Access To Register Address Space Is Locked" mask="0x10"/>
          <bitfield name="SBLK" caption="Blocks Number In a Sector" mask="0xF00"/>
          <bitfield name="PSZ" caption="SmartEEPROM Page Size" mask="0x70000"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLA__PRM">
        <value name="SEMIAUTO" caption="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." value="0"/>
        <value name="FULLAUTO" caption="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode when system is not in standby mode." value="1"/>
        <value name="MANUAL" caption="NVM block does not enter low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLA__WMODE">
        <value name="MAN" caption="Manual Write" value="0"/>
        <value name="ADW" caption="Automatic Double Word Write" value="1"/>
        <value name="AQW" caption="Automatic Quad Word" value="2"/>
        <value name="AP" caption="Automatic Page Write" value="3"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__CMD">
        <value name="EP" caption="Erase Page - Only supported in the USER and AUX pages." value="0x0"/>
        <value name="EB" caption="Erase Block - Erases the block addressed by the ADDR register, not supported in the user page" value="0x1"/>
        <value name="WP" caption="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register, not supported in the user page" value="0x3"/>
        <value name="WQW" caption="Write Quad Word - Writes a 128-bit word at the location addressed by the ADDR register." value="0x4"/>
        <value name="SWRST" caption="Software Reset - Power-Cycle the NVM memory and replay the device automatic calibration procedure and resets the module configuration registers" value="0x10"/>
        <value name="LR" caption="Lock Region - Locks the region containing the address location in the ADDR register." value="0x11"/>
        <value name="UR" caption="Unlock Region - Unlocks the region containing the address location in the ADDR register." value="0x12"/>
        <value name="SPRM" caption="Sets the power reduction mode." value="0x13"/>
        <value name="CPRM" caption="Clears the power reduction mode." value="0x14"/>
        <value name="PBC" caption="Page Buffer Clear - Clears the page buffer." value="0x15"/>
        <value name="SSB" caption="Set Security Bit" value="0x16"/>
        <value name="BKSWRST" caption="Bank swap and system reset, if SMEE is used also reallocate SMEE data into the opposite BANK" value="0x17"/>
        <value name="CELCK" caption="Chip Erase Lock - DSU.CE command is not available" value="0x18"/>
        <value name="CEULCK" caption="Chip Erase Unlock - DSU.CE command is available" value="0x19"/>
        <value name="SBPDIS" caption="Sets STATUS.BPDIS, Boot loader protection is discarded until CBPDIS is issued or next start-up sequence" value="0x1A"/>
        <value name="CBPDIS" caption="Clears STATUS.BPDIS, Boot loader protection is not discarded" value="0x1B"/>
        <value name="ASEES0" caption="Activate SmartEEPROM Sector 0, deactivate Sector 1" value="0x30"/>
        <value name="ASEES1" caption="Activate SmartEEPROM Sector 1, deactivate Sector 0" value="0x31"/>
        <value name="SEERALOC" caption="Starts SmartEEPROM sector reallocation algorithm" value="0x32"/>
        <value name="SEEFLUSH" caption="Flush SMEE data when in buffered mode" value="0x33"/>
        <value name="LSEE" caption="Lock access to SmartEEPROM data from any mean" value="0x34"/>
        <value name="USEE" caption="Unlock access to SmartEEPROM data" value="0x35"/>
        <value name="LSEER" caption="Lock access to the SmartEEPROM Register Address Space (above 64KB)" value="0x36"/>
        <value name="USEER" caption="Unlock access to the SmartEEPROM Register Address Space (above 64KB)" value="0x37"/>
      </value-group>
