bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51N19A.atdf
        <register name="PINCFG" offset="0x40" rw="RW" size="1" count="32" initval="0x00" caption="Pin Configuration">
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x1"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x2"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x40"/>
        </register>
      </register-group>
      <register-group name="PORT" caption="Port Module">
        <register-group name="GROUP" name-in-module="GROUP" offset="0x00" size="0x80" count="3"/>
      </register-group>
      <value-group name="PORT_EVCTRL__EVACT0">
        <value name="OUT" caption="Event output to pin" value="0x0"/>
        <value name="SET" caption="Set output register of pin on event" value="0x1"/>
        <value name="CLR" caption="Clear output register of pin on event" value="0x2"/>
        <value name="TGL" caption="Toggle output register of pin on event" value="0x3"/>
      </value-group>
    </module>
    <module name="PUKCC" id="U2009" version="2.5.0" caption="PUblic-Key Cryptography Controller">
      <register-group name="PUKCC" caption="PUblic-Key Cryptography Controller"/>
    </module>
    <module name="QSPI" id="U2008" version="1.6.3" caption="Quad SPI interface">
      <register-group name="QSPI" caption="Quad SPI interface">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LASTXFER" caption="Last Transfer" mask="0x1000000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="MODE" caption="Serial Memory Mode" mask="0x1" values="QSPI_CTRLB__MODE"/>
          <bitfield name="LOOPEN" caption="Local Loopback Enable" mask="0x2"/>
          <bitfield name="WDRBT" caption="Wait Data Read Before Transfer" mask="0x4"/>
          <bitfield name="SMEMREG" caption="Serial Memory reg" mask="0x8"/>
          <bitfield name="CSMODE" caption="Chip Select Mode" mask="0x30" values="QSPI_CTRLB__CSMODE"/>
          <bitfield name="DATALEN" caption="Data Length" mask="0xF00" values="QSPI_CTRLB__DATALEN"/>
          <bitfield name="DLYBCT" caption="Delay Between Consecutive Transfers" mask="0xFF0000"/>
          <bitfield name="DLYCS" caption="Minimum Inactive CS Delay" mask="0xFF000000"/>
        </register>
        <register name="BAUD" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Baud Rate">
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x1"/>
          <bitfield name="CPHA" caption="Clock Phase" mask="0x2"/>
          <bitfield name="BAUD" caption="Serial Clock Baud Rate" mask="0xFF00"/>
          <bitfield name="DLYBS" caption="Delay Before SCK" mask="0xFF0000"/>
        </register>
        <register name="RXDATA" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Receive Data">
          <bitfield name="DATA" caption="Receive Data" mask="0xFFFF"/>
        </register>
        <register name="TXDATA" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Transmit Data">
          <bitfield name="DATA" caption="Transmit Data" mask="0xFFFF"/>
        </register>
        <register name="INTENCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="RXC" caption="Receive Data Register Full Interrupt Disable" mask="0x1"/>
          <bitfield name="DRE" caption="Transmit Data Register Empty Interrupt Disable" mask="0x2"/>
          <bitfield name="TXC" caption="Transmission Complete Interrupt Disable" mask="0x4"/>
          <bitfield name="ERROR" caption="Overrun Error Interrupt Disable" mask="0x8"/>
          <bitfield name="CSRISE" caption="Chip Select Rise Interrupt Disable" mask="0x100"/>
          <bitfield name="INSTREND" caption="Instruction End Interrupt Disable" mask="0x400"/>
        </register>
        <register name="INTENSET" offset="0x18" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="RXC" caption="Receive Data Register Full Interrupt Enable" mask="0x1"/>
          <bitfield name="DRE" caption="Transmit Data Register Empty Interrupt Enable" mask="0x2"/>
          <bitfield name="TXC" caption="Transmission Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="ERROR" caption="Overrun Error Interrupt Enable" mask="0x8"/>
          <bitfield name="CSRISE" caption="Chip Select Rise Interrupt Enable" mask="0x100"/>
          <bitfield name="INSTREND" caption="Instruction End Interrupt Enable" mask="0x400"/>
        </register>
        <register name="INTFLAG" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="RXC" caption="Receive Data Register Full" mask="0x1"/>
          <bitfield name="DRE" caption="Transmit Data Register Empty" mask="0x2"/>
          <bitfield name="TXC" caption="Transmission Complete" mask="0x4"/>
          <bitfield name="ERROR" caption="Overrun Error" mask="0x8"/>
          <bitfield name="CSRISE" caption="Chip Select Rise" mask="0x100"/>
          <bitfield name="INSTREND" caption="Instruction End" mask="0x400"/>
        </register>
        <register name="STATUS" offset="0x20" rw="R" size="4" initval="0x00000200" caption="Status Register">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CSSTATUS" caption="Chip Select" mask="0x200"/>
        </register>
        <register name="INSTRADDR" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Instruction Address">
          <bitfield name="ADDR" caption="Instruction Address" mask="0xFFFFFFFF"/>
        </register>
