bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51N19A.atdf
        <register name="AIRCR" offset="0xD0C" rw="RW" size="4" access-size="4" initval="0xFA050000" caption="Application Interrupt and Reset Control Register">
          <bitfield name="VECTRESET" caption="Must write 0" mask="0x1"/>
          <bitfield name="VECTCLRACTIVE" caption="Must write 0" mask="0x2"/>
          <bitfield name="SYSRESETREQ" caption="System Reset Request" mask="0x4" values="SystemControl_AIRCR__SYSRESETREQ"/>
          <bitfield name="PRIGROUP" caption="Interrupt priority grouping" mask="0x700"/>
          <bitfield name="ENDIANNESS" caption="Data endianness, 0=little, 1=big" mask="0x8000" values="SystemControl_AIRCR__ENDIANNESS"/>
          <bitfield name="VECTKEY" caption="Register key" mask="0xFFFF0000"/>
        </register>
        <register name="SCR" offset="0xD10" rw="RW" size="4" access-size="4" initval="0" caption="System Control Register">
          <bitfield name="SLEEPONEXIT" caption="Sleep-on-exit on handler return" mask="0x2" values="SystemControl_SCR__SLEEPONEXIT"/>
          <bitfield name="SLEEPDEEP" caption="Deep Sleep used as low power mode" mask="0x4" values="SystemControl_SCR__SLEEPDEEP"/>
          <bitfield name="SEVONPEND" caption="Send Event on Pending bit" mask="0x10" values="SystemControl_SCR__SEVONPEND"/>
        </register>
        <register name="CCR" offset="0xD14" rw="RW" size="4" access-size="4" initval="0x00000200" caption="Configuration and Control Register">
          <bitfield name="NONBASETHRDENA" caption="Indicates how processor enters Thread mode" mask="0x1"/>
          <bitfield name="USERSETMPEND" caption="Enables unprivileged software access to STIR register" mask="0x2"/>
          <bitfield name="UNALIGN_TRP" caption="Enables unaligned access traps" mask="0x8" values="SystemControl_CCR__UNALIGN_TRP"/>
          <bitfield name="DIV_0_TRP" caption="Enables divide by 0 trap" mask="0x10"/>
          <bitfield name="BFHFNMIGN" caption="Ignore LDM/STM BusFault for -1/-2 priority handlers" mask="0x100"/>
          <bitfield name="STKALIGN" caption="Indicates stack alignment on exception entry" mask="0x200" values="SystemControl_CCR__STKALIGN"/>
        </register>
        <register name="SHPR1" offset="0xD18" rw="RW" size="4" access-size="4" caption="System Handler Priority Register 1">
          <bitfield name="PRI_4" caption="Priority of system handler 4, MemManage" mask="0xFF"/>
          <bitfield name="PRI_5" caption="Priority of system handler 5, BusFault" mask="0xFF00"/>
          <bitfield name="PRI_6" caption="Priority of system handler 6, UsageFault" mask="0xFF0000"/>
        </register>
        <register name="SHPR2" offset="0xD1C" rw="RW" size="4" access-size="4" initval="0" caption="System Handler Priority Register 2">
          <bitfield name="PRI_11" caption="Priority of system handler 11, SVCall" mask="0xFF000000"/>
        </register>
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" caption="System Handler Control and State Register">
          <bitfield name="MEMFAULTACT" caption="MemManage exception active bit" mask="0x1"/>
          <bitfield name="BUSFAULTACT" caption="BusFault exception active bit" mask="0x2"/>
          <bitfield name="USGFAULTACT" caption="UsageFault exception active bit" mask="0x8"/>
          <bitfield name="SVCALLACT" caption="SVCall active bit" mask="0x80"/>
          <bitfield name="MONITORACT" caption="DebugMonitor exception active bit" mask="0x100"/>
          <bitfield name="PENDSVACT" caption="PendSV exception active bit" mask="0x400"/>
          <bitfield name="SYSTICKACT" caption="SysTick exception active bit" mask="0x800"/>
          <bitfield name="USGFAULTPENDED" caption="UsageFault exception pending bit" mask="0x1000"/>
          <bitfield name="MEMFAULTPENDED" caption="MemManage exception pending bit" mask="0x2000"/>
          <bitfield name="BUSFAULTPENDED" caption="BusFault exception pending bit" mask="0x4000"/>
          <bitfield name="SVCALLPENDED" caption="SVCall pending bit" mask="0x8000"/>
          <bitfield name="MEMFAULTENA" caption="MemManage enable bit" mask="0x10000"/>
          <bitfield name="BUSFAULTENA" caption="BusFault enable bit" mask="0x20000"/>
          <bitfield name="USGFAULTENA" caption="UsageFault enable bit" mask="0x40000"/>
        </register>
        <register name="CFSR" offset="0xD28" rw="RW" size="4" access-size="4" caption="Configurable Fault Status Register">
          <bitfield name="IACCVIOL" caption="Instruction access violation" mask="0x1"/>
          <bitfield name="DACCVIOL" caption="Data access violation" mask="0x2"/>
          <bitfield name="MUNSTKERR" caption="MemManage Fault on unstacking for exception return" mask="0x8"/>
          <bitfield name="MSTKERR" caption="MemManage Fault on stacking for exception entry" mask="0x10"/>
          <bitfield name="MLSPERR" caption="MemManager Fault occured during FP lazy state preservation" mask="0x20"/>
          <bitfield name="MMARVALID" caption="MemManage Fault Address Register valid" mask="0x80"/>
          <bitfield name="IBUSERR" caption="Instruction bus error" mask="0x100"/>
          <bitfield name="PRECISERR" caption="Precise data bus error" mask="0x200"/>
          <bitfield name="IMPRECISERR" caption="Imprecise data bus error" mask="0x400"/>
          <bitfield name="UNSTKERR" caption="BusFault on unstacking for exception return" mask="0x800"/>
          <bitfield name="STKERR" caption="BusFault on stacking for exception entry" mask="0x1000"/>
          <bitfield name="LSPERR" caption="BusFault occured during FP lazy state preservation" mask="0x2000"/>
          <bitfield name="BFARVALID" caption="BusFault Address Register valid" mask="0x8000"/>
          <bitfield name="UNDEFINSTR" caption="Undefined instruction UsageFault" mask="0x10000"/>
          <bitfield name="INVSTATE" caption="Invalid state UsageFault" mask="0x20000"/>
          <bitfield name="INVPC" caption="Invalid PC load UsageFault" mask="0x40000"/>
          <bitfield name="NOCP" caption="No coprocessor UsageFault" mask="0x80000"/>
          <bitfield name="UNALIGNED" caption="Unaligned access UsageFault" mask="0x1000000"/>
          <bitfield name="DIVBYZERO" caption="Divide by zero UsageFault" mask="0x2000000"/>
        </register>
        <register name="HFSR" offset="0xD2C" rw="RW" size="4" access-size="4" caption="HardFault Status Register">
          <bitfield name="VECTTBL" caption="BusFault on a Vector Table read during exception processing" mask="0x2"/>
          <bitfield name="FORCED" caption="Forced Hard Fault" mask="0x40000000"/>
          <bitfield name="DEBUGEVT" caption="Debug: always write 0" mask="0x80000000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" access-size="4" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="" mask="0x1"/>
          <bitfield name="BKPT" caption="" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="" mask="0x4"/>
          <bitfield name="VCATCH" caption="" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="" mask="0x10"/>
        </register>
        <register name="MMFAR" offset="0xD34" rw="RW" size="4" access-size="4" caption="MemManage Fault Address Register">
          <bitfield name="ADDRESS" caption="Address that generated the MemManage fault" mask="0xFFFFFFFF"/>
        </register>
        <register name="BFAR" offset="0xD38" rw="RW" size="4" access-size="4" caption="BusFault Address Register">
          <bitfield name="ADDRESS" caption="Address that generated the BusFault" mask="0xFFFFFFFF"/>
        </register>
        <register name="AFSR" offset="0xD3C" rw="RW" size="4" access-size="4" caption="Auxiliary Fault Status Register">
          <bitfield name="IMPDEF" caption="AUXFAULT input signals" mask="0xFFFFFFFF"/>
        </register>
        <register name="PFR" offset="0xD40" rw="RW" size="4" access-size="4" count="2" caption="Processor Feature Register">
        </register>
        <register name="DFR" offset="0xD48" rw="R" size="4" access-size="4" caption="Debug Feature Register">
        </register>
        <register name="ADR" offset="0xD4C" rw="R" size="4" access-size="4" caption="Auxiliary Feature Register">
        </register>
